УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/ДЛ_ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДЛ_ЗаявкаНаДоставку</name>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.КорректировкаРеализации</basedOn>
  <basedOn>Document.ТранспортнаяНакладная</basedOn>
  <basedOn>Document.РасходныйОрдерНаТовары</basedOn>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <basedOn>Document.КорректировкаПриобретения</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Основание", ДокументОснование) Тогда  
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Параметры.Свойство("НомерЗаказа") Тогда
		
		Объект.НомерЗаказа = Параметры.НомерЗаказа; 
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.НомерЗаказа) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаказаСтрокой = ДЛ_ДеловыеЛинии.ПолучитьЖурналОтправок(Новый Структура("ИдентификаторДокумента", Объект.НомерЗаказа), Истина);
	ДанныеЗаказа = ДЛ_ДеловыеЛинии.ДесериализоватьСтруктуруПараметров(ДанныеЗаказаСтрокой);
	
	
	Если ДанныеЗаказа["orders"] = Неопределено Или ДанныеЗаказа["orders"].Количество() = 0 Тогда		
		
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить информацию по номеру заказа " + Объект.НомерЗаказа);	
		
		Отказ = Истина;
		
	Иначе 
		
		Если Объект.НомерЗаказа <> ДанныеЗаказа["orders"][0]["orderId"] Тогда
			
			Объект.НомерЗаказа = ДанныеЗаказа["orders"][0]["orderId"];	
			
		КонецЕсли;
		
		ОтобразитьКарточкуЗаказа(ДанныеЗаказа["orders"][0]); 		
		ИнициализироватьПанельПечати(ДанныеЗаказа["orders"][0]["documents"]);
		
		ДанныеОтправитель = ДанныеЗаказа["orders"][0]["sender"];
		ОтправительКонтактноеЛицоНаименование = ДанныеОтправитель["contacts"]; 
		ОтправительКонтактноеЛицоТелефонПредставление = ДанныеОтправитель["phones"];		
		КоличествоМест =  ДанныеЗаказа["orders"][0]["freight"]["places"];
		
	КонецЕсли;	
		
КонецПроцедуры 		 

&НаСервере
Функция ЗаполнитьТелоЗаказа(ДанныеЗаказа) 
	
	Тело = "";
	
	ШаблонЗаголовок          = Символы.ПС + "<div><span>%1</span><span> № %2 от %3 | </span><span>%4</span></div>";
	ШаблонПричинаОтклонения  = Символы.ПС + "<div><span>Причина отклонения:</span><span>%1</span></div>";
	ШаблонГруз               = Символы.ПС + "<div><span>Груз:</span><span>%1</span></div>"; 
	ШаблонНомераНакладных    = Символы.ПС + "<div><span>Номера накладных:</span><span>%1</span></div>";
	ШаблонВидПеревозки       = Символы.ПС + "<div><span>ВидПеревозки:</span><span>%1</span></div>";
	ШаблонГрузПараметры      = Символы.ПС + "<div><span>%1</span></div>";
	ШаблонНегабаритныйГруз   = Символы.ПС + "<div><span>Негабаритный груз:</span><span>%1</span>|<span>%2</span>|<span>%3</span></div>";
	ШаблонБлокировка         = Символы.ПС + "<div><span>%1:</span><span>%2</span></div>";
	ШаблонТаблица            = Символы.ПС + "<table>%1</table>";
	ШаблонСекцияТаблицы      = Символы.ПС + "<tr><th colspan=""%1"">%2</th></tr>";
	ШаблонЗаголовокДокументы = Символы.ПС + "<tr><th>%1</th><th>%2</th></tr>";
	ШаблонСтрокаТаблицы      = Символы.ПС + "<tr><td>%1</td><td>%2</td></tr>";
	ШаблонСтрокаТаблицыБлокировки = Символы.ПС + "<tr><td colspan=""2"">%1</td></tr>";  
	
	ЕстьСопроводительныеДокуметы = Ложь; 
	НомераНакладных = "";
	
	Для Каждого Документ Из ДанныеЗаказа["documents"] Цикл   
		
		КомментарийЗаказа = ?(ЗначениеЗаполнено(КомментарийЗаказа), КомментарийЗаказа, Документ["comment"]);
		
		Если Документ["type"] = "shipping" Тогда
			
			ВидПеревозки = Документ["serviceKind"];	
			НомераНакладных = НомераНакладных + "" + ?(НомераНакладных = "", "", ", ") + Документ["id"];
			
			Если ТипЗнч(Документ["accompanyingDocuments"]) = Тип("Массив") И Документ["accompanyingDocuments"].Количество() > 0 Тогда
				
				ЕстьСопроводительныеДокуметы = Истина;
				
				МассивСД = Документ["accompanyingDocuments"];				
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеГруза = ДанныеЗаказа["freight"]; 
	ВидЗаказа        = ?(ДанныеЗаказа["isPreorder"], "Предзаказ", "Заказ"); 
	СтатусЗаказа = ?(ДанныеЗаказа["progressPercent"] = Неопределено, ДанныеЗаказа["stateName"], ДанныеЗаказа["stateName"]);
	ДополнитьСтрокуПоШаблону(Тело, ШаблонЗаголовок, ВидЗаказа, ДанныеЗаказа["orderId"], ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ДанныеЗаказа["orderedAt"]), СтатусЗаказа); 
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(НомераНакладных), Тело, ШаблонНомераНакладных, НомераНакладных);
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["declineReason"]), Тело, ШаблонПричинаОтклонения, ДанныеЗаказа["declineReason"]);  
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ВидПеревозки), Тело, ШаблонВидПеревозки, ВидПеревозки);
	
	Если ДанныеГруза <> Неопределено Тогда
		
		ДополнитьСтрокуПоШаблону(Тело, ШаблонГруз, ДанныеГруза["name"]);
		ДополнитьСтрокуПоШаблону(Тело, ШаблонГрузПараметры, ПолучитьПредставлениеПараметровГруза(ДанныеГруза)); 
		
	КонецЕсли;
	
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["note"]), Тело, ШаблонГрузПараметры, ДанныеЗаказа["note"]);
   	
	ТелоТаблицы = "";  	 
	
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "Отправка");
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Отправитель", ДанныеЗаказа["sender"]["name"]);
	
	Если ДанныеЗаказа["orderedDeliveryFromAddress"] = Истина Тогда  
		
		АдресОтправки = ДанныеЗаказа["derival"]["address"];
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "От адреса", ?(ЗначениеЗаполнено(АдресОтправки), АдресОтправки, ДанныеЗаказа["derival"]["city"]));
		
	Иначе
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "С терминала", ДанныеЗаказа["derival"]["terminalName"]);
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Адрес",       ДанныеЗаказа["derival"]["terminalAddress"]);
		
	КонецЕсли;
	
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["sender"]["contacts"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "ФИО контактного лица", ДанныеЗаказа["sender"]["contacts"]);
    ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["sender"]["phones"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Телефон контактного лица", ДанныеЗаказа["sender"]["phones"]);
	
	Если ЗначениеЗаполнено(КомментарийЗаказа) Тогда 			
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Комментарий", КомментарийЗаказа);    		
		
	КонецЕсли; 
	
	Если (ДанныеЗаказа["derival"]["driver"] <> Неопределено И 
		(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["driver"]["driverName"]) Или (ЗначениеЗаполнено(ДанныеЗаказа["derival"]["driver"]["driverPhone"])))) Или
		(ДанныеЗаказа["derival"]["vehicle"] <> Неопределено И 
		(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["vehicle"]["vehicleType"]) Или (ЗначениеЗаполнено(ДанныеЗаказа["derival"]["vehicle"]["vehicleLicencePlate"])))) Тогда  
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "Сведения о водителе при заборе от адреса");    
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["driver"]["driverName"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Имя водителя", ДанныеЗаказа["derival"]["driver"]["driverName"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["driver"]["driverPhone"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Телефон водителя", ДанныеЗаказа["derival"]["driver"]["driverPhone"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["vehicle"]["vehicleType"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Марка машины", ДанныеЗаказа["derival"]["vehicle"]["vehicleType"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["derival"]["vehicle"]["vehicleLicencePlate"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Номер машины", ДанныеЗаказа["derival"]["vehicle"]["vehicleLicencePlate"]);		
		
	КонецЕсли;	  			 
	
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "Получение");
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Получатель", ДанныеЗаказа["receiver"]["name"]); 	
	
	Если ДанныеЗаказа["orderedDeliveryToAddress"] = Истина Тогда
		
		АдресДоставки = ДанныеЗаказа["arrival"]["address"];
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "До адреса", ?(ЗначениеЗаполнено(АдресДоставки), АдресДоставки, ДанныеЗаказа["arrival"]["city"]));  
		
		ДоставкаДоАдреса = Истина;
		
	Иначе
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "До терминала", 	ДанныеЗаказа["arrival"]["terminalName"]);
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Адрес",       	ДанныеЗаказа["arrival"]["terminalAddress"]);
		
	КонецЕсли; 
	
	ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["receiver"]["contacts"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "ФИО контактного лица", ДанныеЗаказа["receiver"]["contacts"]);
    ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["receiver"]["phones"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Телефон контактного лица", ДанныеЗаказа["receiver"]["phones"]);
	
	Если (ДанныеЗаказа["arrival"]["driver"] <> Неопределено И 
		(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["driver"]["driverName"]) Или (ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["driver"]["driverPhone"])))) Или
		(ДанныеЗаказа["arrival"]["vehicle"] <> Неопределено И 
		(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["vehicle"]["vehicleType"]) Или (ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["vehicle"]["vehicleLicencePlate"])))) Тогда  
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "Сведения о водителе при доставке до адреса");    
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["driver"]["driverName"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Имя водителя", ДанныеЗаказа["arrival"]["driver"]["driverName"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["driver"]["driverPhone"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Телефон водителя", ДанныеЗаказа["arrival"]["driver"]["driverPhone"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["vehicle"]["vehicleType"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Марка машины", ДанныеЗаказа["arrival"]["vehicle"]["vehicleType"]);
		ДополнитьСтрокуПоШаблонуСУсловием(ЗначениеЗаполнено(ДанныеЗаказа["arrival"]["vehicle"]["vehicleLicencePlate"]), ТелоТаблицы, ШаблонСтрокаТаблицы, "Номер машины", ДанныеЗаказа["arrival"]["vehicle"]["vehicleLicencePlate"]);		
		
	КонецЕсли;
		
	Если ДанныеЗаказа["isAir"] = Истина Тогда		
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Комментарий", ДанныеЗаказа["air"]["comment"]);
		
	КонецЕсли;  
	
	ГрафикПеревозки = ДЛ_ДеловыеЛинии.ПрочитатьДанныеГрафикаПеревозки(ДанныеЗаказа["orderDates"],, ДанныеЗаказа["air"]);  
	
	РассчетныеСроки = ДанныеЗаказа["orderTimeInDays"]; 
	
	Если РассчетныеСроки <> Неопределено Тогда
		
		СрокДоставки = РассчетныеСроки["delivery"];	
		СрокДоставкиСопроводительных = РассчетныеСроки["deliveryAccdoc"];
		
	КонецЕсли;
	
	Если ГрафикПеревозки.Количество() Тогда
		
		ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "График перевозки");
		
		Для Каждого ТекущаяЗапись Из ГрафикПеревозки Цикл
			
			ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, Формат(ТекущаяЗапись.Значение, "ДФ=dd.MM.yyyy"), ТекущаяЗапись.Представление);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СрокДоставки) Тогда 
			
			ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Срок доставки, дн", СрокДоставки); 
			
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СрокДоставкиСопроводительных) Тогда  
			
			ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Срок доставки сопр. документов, дн.", СрокДоставкиСопроводительных);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСекцияТаблицы, 2, "Оплата");	
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Основной плательщик",    ДанныеЗаказа["payer"]["name"]);	
	ДополнитьСтрокуПоШаблонуСУсловием(ДанныеЗаказа["withWebOrder"] = Истина, ТелоТаблицы, ШаблонСтрокаТаблицы, "Сумма наложенного платежа", ДанныеЗаказа["webOrderItemsSum"]);
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Сумма",         ДанныеЗаказа["totalSum"]);
	ДополнитьСтрокуПоШаблону(ТелоТаблицы, ШаблонСтрокаТаблицы, "Статус оплаты", ?(ДанныеЗаказа["isPaid"] = Неопределено Или Не ЗначениеЗаполнено(ДанныеЗаказа["totalSum"]), "", Формат(ДанныеЗаказа["isPaid"], "БЛ='требуется оплата'; БИ=оплачено")));			
				
	ДополнитьСтрокуПоШаблону(Тело, ШаблонТаблица, ТелоТаблицы);	
	
	Возврат Тело;
	
КонецФункции 

&НаСервере
Функция ПолучитьТелоЗаказаМультиотправки(НомерЗаказа) 
	
	Результат = "";
	
	ДанныеЗаказа = ДЛ_ДеловыеЛинии.ПолучитьЖурналОтправок(Новый Структура("ИдентификаторДокумента", НомерЗаказа)); 
	
	Тело = "<br>"; 
	
    Если ДанныеЗаказа["orders"] <> Неопределено Тогда
	
		Результат = ДополнитьСтрокуПоШаблону(Тело, ЗаполнитьТелоЗаказа(ДанныеЗаказа["orders"][0]));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОтобразитьКарточкуЗаказа(ДанныеЗаказа)
	
	ШаблонРазметки = 
	"<html>
	|	<head>
	|		<style>
	|			th,td
	|			{
	|			padding: 5px 5px;
	|			border: 1px solid #cecfd5;
	|			}
	|			table
	|			{
	|			font-size: 14;
	|			font-family: sans-serif;
	|			border-collapse: collapse;
	|			margin-top: 5pt;
	|           width:100%%;
	|			}
	|			.caption
	|			{
	|			font-size: 16;
	|			text-align:left;
	|			background: #FAAC18;
	|			}
	|			.field
	|			{
	|			font-weight:bold;
	|			width: 72pt;
	|			}
	|			span
	|			{
	|			margin: 10pt;
	|			font-size: 16;
	|			font-weight:bold;
	|			}
	|			.detail
	|			{
	|			font-size: 12;
	|			}
	|		</style>
	|	</head>
	|	<body>
	|		%1
	|	</body>
	|</html>";
	
	Тело = "";   
	
	ДополнитьСтрокуПоШаблону(Тело, ЗаполнитьТелоЗаказа(ДанныеЗаказа)); 	 
	
	Для Каждого Элемент Из ДанныеЗаказа["documents"] Цикл  
		
		КомментарийЗаказа = Элемент["comment"];
		
		Если ЗначениеЗаполнено(КомментарийЗаказа) Тогда
			
			СтрокаПоискаМультизаказа = "Мультизаявка: объединить с ";
			
			НачалоМультизаказа = СтрНайти(КомментарийЗаказа, СтрокаПоискаМультизаказа); 
			
			Если НачалоМультизаказа > 0 Тогда
				
				КонецМультизаказа = СтрНайти(КомментарийЗаказа, ".",, НачалоМультизаказа) - 1;
				
				ПодстрокаМультизаказа = СтрЗаменить(Сред(КомментарийЗаказа, НачалоМультизаказа, КонецМультизаказа), СтрокаПоискаМультизаказа, "");  
				
				МассивНомеровЗаявок = СтрРазделить(ПодстрокаМультизаказа, ",", Ложь);
				
				Для Каждого НомерЗаявки Из МассивНомеровЗаявок Цикл
					
					Если НомерЗаявки <>	Объект.НомерЗаказа Тогда 
						
						ДополнитьСтрокуПоШаблону(Тело, ПолучитьТелоЗаказаМультиотправки(НомерЗаявки));
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КарточкаЗаказа = ДополнитьСтрокуПоШаблону("", ШаблонРазметки, Тело);	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнитьСтрокуПоШаблону(Приемник, Шаблон, Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
	
	Приемник = Приемник + СтрШаблон(Шаблон, Параметр1, Параметр2, Параметр3, Параметр4);
	
	Возврат Приемник;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДополнитьСтрокуПоШаблонуСУсловием(Условие, Приемник, Шаблон, Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
	
	Если Условие Тогда
		
		ДополнитьСтрокуПоШаблону(Приемник, Шаблон, Параметр1, Параметр2, Параметр3, Параметр4);
		
	КонецЕсли; 
	
	Возврат Приемник;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеПараметровГруза(СтруктураДанных) 	
	
	Представление = ""; 
	
	Вес = ?(СтруктураДанных["weight"] = Неопределено, 0 , СтруктураДанных["weight"]); 
	Объем = ?(СтруктураДанных["volume"] = Неопределено, 0 , СтруктураДанных["volume"]); 
	КоличествоМест = СтруктураДанных["places"];
	Длина = ?(СтруктураДанных["length"] = Неопределено, 0 , СтруктураДанных["length"]);
	Ширина = ?(СтруктураДанных["width"] = Неопределено, 0 , СтруктураДанных["width"]);
	Высота = ?(СтруктураДанных["height"] = Неопределено, 0 , СтруктураДанных["height"]); 
	
	Если ЗначениеЗаполнено(Число(Вес)) Тогда
		
		Представление = Вес + " кг";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Число(Объем)) Тогда
		
		Представление = Представление + Символы.ПС + Объем + " м3";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоМест) Тогда
		
		Представление = Представление + Символы.ПС + КоличествоМестПрописью(КоличествоМест);
		
	КонецЕсли;		
	
	Если Число(Длина) + Число(Ширина) + Число(Высота) <> 0 Тогда
		
		Представление = Представление + Символы.ПС + Длина + " x " + Ширина  + " x " + Высота;
		
	КонецЕсли; 
	
	Представление = СтрЗаменить(СокрЛП(Представление), Символы.ПС, " | "); 
	
	Возврат Представление;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьНегабаритныйГруз(СтруктураДанных) 	
	
	Результат =	(СтруктураДанных["oversizedVolume"] <> Неопределено И ЗначениеЗаполнено(Число(СтруктураДанных["oversizedVolume"]))) Или
		(СтруктураДанных["oversizedPlaces"] <> Неопределено И ЗначениеЗаполнено(СтруктураДанных["oversizedPlaces"])) Или
		(СтруктураДанных["oversizedWeight"] <> Неопределено И ЗначениеЗаполнено(Число(СтруктураДанных["oversizedWeight"])));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция КоличествоМестПрописью(Количество)
	
	Если Количество = 0 Или Количество = Неопределено Тогда
		
		МестПрописью = "";
		
	Иначе
		
		МестПрописью = ЧислоПрописью(Количество, "Л=ru_RU; НД=Ложь", "> место, > места, > мест, с, , , , , 0");
		МестПрописью = Строка(Количество) + Сред(МестПрописью, Найти(МестПрописью, ">") + 1);
		
	КонецЕсли; 
	
	Возврат МестПрописью;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументОснование", ДокументОснование);
		
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.КарточкаЗаказа", ПараметрыФормы);
		
		Закрыть(); 
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.НомерЗаказа) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.Ссылка);
		
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.КарточкаЗаказа", ПараметрыФормы);
		
		Закрыть();
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьПанельПечати(ДанныеДокументов)
	
	Если ДанныеДокументов = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Для Каждого Документ Из ДанныеДокументов Цикл
		
		ТипДокумента = Документ["type"];
		
		Если ТипДокумента = "shipping" Тогда 
			
			ДокументИД = Документ["uid"];
			ДокументНомер = Документ["id"];
			
			Если ЗначениеЗаполнено(ДокументИД) И Документ["availableDocs"] <> Неопределено Тогда
				
				Для Каждого ДоступныйДокумент Из Документ["availableDocs"] Цикл
					
					Если ДоступныйДокумент = "bill"	Тогда
						
						ИмяКнопки = "Счет";						
						
					ИначеЕсли ДоступныйДокумент = "order" Тогда	  
						
						ИмяКнопки = "Накладная";						
						
					ИначеЕсли ДоступныйДокумент = "invoice" Тогда	  
						
						ИмяКнопки = "Счет-фактура";
						
					ИначеЕсли ДоступныйДокумент = "giveout" Тогда
						
						ИмяКнопки = "Накладная на выдачу";
						
					Иначе
						
						Продолжить;						
						
					КонецЕсли; 
					
					ДобавитьКомандуВМенюПечати(СтрШаблон("%1 №%2", ИмяКнопки, ДокументНомер), ДокументИД, ДоступныйДокумент);	
					
				КонецЦикла;
				
			КонецЕсли;			
			
		ИначеЕсли ТипДокумента = "request" Тогда 
			
			Если ЗначениеЗаполнено(Документ["id"]) Тогда
			
				ДобавитьКомандуВМенюПечати("Заявка на забор", СтрЗаменить(Документ["id"], Символы.НПП, ""), ТипДокумента);
				
			КонецЕсли;	
			
		ИначеЕсли ТипДокумента = "request_sf" Тогда   
			
			Если ЗначениеЗаполнено(Документ["id"]) Тогда
			
				ДобавитьКомандуВМенюПечати("Заявка на отвоз", СтрЗаменить(Документ["id"], Символы.НПП, ""), ТипДокумента);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьКомандуВМенюПечати(ИмяКнопки, ДокументИД, ТипДокумента)  
	
	НоваяКоманда = Команды.Добавить(СтрШаблон("%1_ID_%2", ТипДокумента, ДокументИД));
	НоваяКоманда.Действие = "ПечатьДокумента";
	НоваяКоманда.Заголовок = ИмяКнопки;
	
	НовыйЭлемент = Элементы.Добавить("КнопкаПечати_" + НоваяКоманда.Имя, Тип("КнопкаФормы"), Элементы.Печать);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда) 
	
	#Если ВебКлиент Тогда
		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Печать недоступна в web-клиенте"); 
		
	Возврат;
		
	#КонецЕсли
	
	#Если НЕ ВебКлиент Тогда
	
	ДанныеКоманды = СтрЗаменить(Команда.Имя, "_ID_", Символы.ПС);	
	ТипДокумента = СтрПолучитьСтроку(ДанныеКоманды, 1);
	ДокументИД = СтрПолучитьСтроку(ДанныеКоманды, 2);
	
	Если ТипДокумента = "request" Тогда
		
		ОтветBase64 = ПолучитьПечатнуюФормуЗаявки(ДокументИД, "ЗаявкаНаЗабор");
		
	ИначеЕсли ТипДокумента = "request_sf" Тогда  
		
		ОтветBase64 = ПолучитьПечатнуюФормуЗаявки(ДокументИД, "ЗаявкаНаОтвоз");
		
	Иначе     
		
		ОтветBase64 = ПолучитьПечатнуюФормуНакладной(ТипДокумента, ДокументИД);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтветBase64) Тогда
		
		ДвоичныеДанные = Base64Значение(ОтветBase64);
		
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		
		ДвоичныеДанные.Записать(ИмяФайла);
		
		ЗапуститьПриложение(ИмяФайла);
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПечатнуюФормуЗаявки(ДокументИД, ИмяМетода) 
	
	Результат = Неопределено;
	
	СтруктураОтвета = ДЛ_ДеловыеЛинии.ПолучитьДанныеПечатиЗаявки(ДокументИД, ИмяМетода);
	
	Если СтруктураОтвета["errors"] <> Неопределено Тогда
		
		Для Каждого Ошибка Из СтруктураОтвета["errors"] Цикл
			
			Сообщить(Ошибка["title"]);	
			
		КонецЦикла;
		
	Иначе	
		
		Результат = СтруктураОтвета["base64"];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции   

&НаСервере
Функция ПолучитьПечатнуюФормуНакладной(ТипДокумента, ДокументИД)  
	
	Результат = Неопределено;
	
	СтруктураОтвета = ДЛ_ДеловыеЛинии.ПолучитьДанныеПечатиНакладной(ТипДокумента, ДокументИД);  
	
	Если СтруктураОтвета["errors"] <> Неопределено Тогда
		
		Для Каждого Ошибка Из СтруктураОтвета["errors"] Цикл
			
			Сообщить(Ошибка["title"]);	
			
		КонецЦикла;
		
	Иначе	
		
		Результат = СтруктураОтвета["data"][0]["base64"];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередатьАртикулыГрузовыхМест(Команда)
	
	СтруктураПараметров = Новый Структура("НомерЗаказа, КоличествоМест", Объект.НомерЗаказа, КоличествоМест); 
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.АртикулыГрузовыхМест", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГрузовыхМест(Команда)
	
	СтруктураПараметров = Новый Структура("НомерЗаказа, ТипПечати", Объект.НомерЗаказа, "ПечатьЭтикеткиГруз"); 
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ВыборЭтикетки", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСопроводительныеДокументы(Команда)
	
	СтруктураПараметров = Новый Структура("НомерЗаказа, ТипПечати", Объект.НомерЗаказа, "ПечатьЭтикеткиДокументы"); 
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ВыборЭтикетки", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
КонецПроцедуры

&НаСервере
Функция ВнестиИзмененияНаСервере()
	
	Результат = Новый Структура;
	
	ДоступныеИзменения = ДЛ_ДеловыеЛинии.ПолучитьДоступныеИзменения(Объект.НомерЗаказа);
	
	ДоступныеИзменения = ДоступныеИзменения["data"];
	
	Если ЗначениеЗаполнено(ДоступныеИзменения) Тогда 
		
		Если ДоступныеИзменения["receiver"]["available"] = Истина Тогда
			
			Результат.Вставить("Получатель", "");
			
		КонецЕсли; 
		
		Если ДоступныеИзменения["payer"]["available"] = Истина Тогда
			
			Результат.Вставить("Плательщик", ДоступныеИзменения["payer"]["info"]);
			
		КонецЕсли;  
		
		КонтактнаяИнформация = ДоступныеИзменения["contactInfo"];  
		
		Если КонтактнаяИнформация["changeSender"]["available"] = Истина Тогда
			
			Результат.Вставить("КонтактнаяИнформацияОтправитель", "");
			
		КонецЕсли;  
		
		Если КонтактнаяИнформация["changeReceiver"]["available"] = Истина Тогда
			
			Результат.Вставить("КонтактнаяИнформацияПолучатель", "");
			
		КонецЕсли;
		
		Если ДоступныеИзменения["pickupInfo"]["available"] = Истина Тогда
			
			Результат.Вставить("АдресВремяЗабора", "");
			
		КонецЕсли;  
		
		Если ДоступныеИзменения["deliveryInfo"]["available"] = Истина Тогда
			
			Результат.Вставить("АдресВремяДоставки", "");
			
		КонецЕсли; 
		
		Если ДоступныеИзменения["suspend"]["available"] = Истина Тогда  
			
			ПриостановкаИнформация = ДоступныеИзменения["suspend"]["info"]; 		
			ПриостановкаИнформация = "" + ПриостановкаИнформация["warning"] + Символы.ПС + ПриостановкаИнформация["stateInfo"];
			
			Результат.Вставить("Приостановка", ПриостановкаИнформация);
			
		КонецЕсли;
		
		Если ДоступныеИзменения["resume"]["available"] = Истина Тогда  
			
			ПриостановкаИнформация = ДоступныеИзменения["resume"]["info"]; 		
			ПриостановкаИнформация = "" + ПриостановкаИнформация["warning"] + Символы.ПС + ПриостановкаИнформация["stateInfo"];
			
			Результат.Вставить("Возобновление", ПриостановкаИнформация);
			
		КонецЕсли; 
		
		Если ДоступныеИзменения["cancelPickup"]["available"] = Истина Тогда
			
			Результат.Вставить("ОтменаЗабора", "");
			
		КонецЕсли;  
		
		Если ДоступныеИзменения["cancelDelivery"]["available"] = Истина Тогда
			
			Результат.Вставить("ОтменаДоставки", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВнестиИзменения(Команда) 
	
	СтруктураПараметров = ВнестиИзмененияНаСервере();
	
	Если СтруктураПараметров.Количество() > 0 Тогда 
		
		СтруктураПараметров.Вставить("НомерЗаказа", Объект.НомерЗаказа); 
		СтруктураПараметров.Вставить("ОтправительКонтактноеЛицоНаименование", ОтправительКонтактноеЛицоНаименование);
		СтруктураПараметров.Вставить("ОтправительКонтактноеЛицоТелефонПредставление", ОтправительКонтактноеЛицоТелефонПредставление); 
		СтруктураПараметров.Вставить("ДоставкаДоАдреса", ДоставкаДоАдреса);
		
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ИзменениеЗаказа", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	Иначе     
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют поля доступные для изменения");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЛогиapiЗапросов(Команда)
	
	ДЛ_ДеловыеЛинииКлиент.ОткрытьЛоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьЗаказ(Команда) 
	
	СтруктураПараметров = Новый Структура("ДанныеЗаказаСтрокой", ДанныеЗаказаСтрокой);
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.КарточкаЗаказа", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДокументыОснования(Команда)
	
	Элементы.грОснования.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Маркировка(Команда)                   
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(Новый Структура("НомерЗаказа, КоличествоМест", Объект.НомерЗаказа, КоличествоМест));
	
	ПараметрыОткрытия = Новый Структура;			
	ПараметрыОткрытия.Вставить("МассивЗаказов", МассивЗаказов);	
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.Маркировка", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры
